
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/109naoki/rss-infra/actions/runs/8414617672)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-091f21a54fc911aba]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08f057da2c1e6f29b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ff4b7cf67029f0dd]
aws_security_group.alb: Refreshing state... [id=sg-02ec66d913b4fb6e9]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-046d00b4612d31901]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-035cfa7d06994e758]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-019a1aa7d4f2158c2]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07d1d80f0ed6bb932]
aws_security_group.ecs: Refreshing state... [id=sg-0c52d53b99ba37ca7]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a8fdfa87f1df4d2c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0559881d84db86322]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-023ebf38354652734]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-048af904a6d32cb40]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f0375cca0d460ec1]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2882790752]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0654f69cb494833ec]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c1514818bf88c6c9]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0559881d84db863221080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07591b3e6fbcf480f]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f6bab745980dd060]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07e39ac159916c26b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b8866ccab1204bb6]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0171619a4015cf390]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-028455c38671132b7]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-046d00b4612d319011080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07d1d80f0ed6bb9321080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "go-rss-server-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-02ec66d913b4fb6e9",
        ]
      + subnets                                                      = [
          + "subnet-048af904a6d32cb40",
          + "subnet-0f0375cca0d460ec1",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Hello, World"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.alb_target_group will be created
  + resource "aws_lb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-rss-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-091f21a54fc911aba"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.alb_target_group: Creating...
aws_lb_target_group.alb_target_group: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:targetgroup/go-rss-server-target-group/a223748d09ac38bc]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Creation complete after 2m42s [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:loadbalancer/app/go-rss-server-alb/9c21f6c7b0c4b8de]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:listener/app/go-rss-server-alb/9c21f6c7b0c4b8de/af8b4fae608060c0]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:listener-rule/app/go-rss-server-alb/9c21f6c7b0c4b8de/af8b4fae608060c0/bb66fce5d939d399]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"e3a709d7622afe303f504b01742d86386509b360","Vars":{},"WorkflowName":"Terraform"} -->